## 모듈 외울 것

In [1]:
import pandas as pd
import numpy as np

In [2]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import OneHotEncoder
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns

## 타이타닉 예제 가져오기

In [4]:
import seaborn as sns
data = sns.load_dataset(('titanic'))

### 타이타닉 예제 csv로 저장하기

In [5]:
data.to_csv("data.csv", encoding="utf-8", index=False)

### data 가져오기

In [3]:
df = pd.read_csv("data.csv", encoding='utf-8')

### 상위 3개 표시/ 하위 3개 표시

In [7]:
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [8]:
df.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

## dataframe 정보 확인

In [9]:
type(df)

pandas.core.frame.DataFrame

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   survived     891 non-null    int64
 2   pclass       891 non-null    int64
 3   sex          891 non-null    object
 4   age          714 non-null    float64
 5   sibsp        891 non-null    int64
 6   parch        891 non-null    int64
 7   fare         891 non-null    float64
 8   embarked     889 non-null    object
 9   class        891 non-null    object
 10  who          891 non-null    object
 11  adult_male   891 non-null    bool
 12  deck         203 non-null    object
 13  embark_town  889 non-null    object
 14  alive        891 non-null    object
 15  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(5), object(7)
memory usage: 99.3+ KB

In [11]:
df.shape

(891, 15)

In [12]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [16]:
df.iloc[5].dtype

dtype('O')

In [17]:
df.iloc[:,5].dtype

dtype('int64')

In [18]:
df.iloc[5]

survived                0
pclass                  3
sex                  male
age                   NaN
sibsp                   0
parch                   0
fare               8.4583
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 5, dtype: object

In [19]:
df.iloc[:,5]

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    2
889    0
890    0
Name: parch, Length: 891, dtype: int64

In [20]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [58]:
df.sex.nunique()

2

In [60]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [59]:
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

### 라벨을 기반으로 행렬

In [38]:
df.loc[3]

Unnamed: 0               3
survived                 1
pclass                   1
sex                 female
age                   35.0
sibsp                    1
parch                    0
fare                  53.1
embarked                 S
class                First
who                  woman
adult_male           False
deck                     C
embark_town    Southampton
alive                  yes
alone                False
Name: 3, dtype: object

### 수치형 column들만 나타내기

In [42]:
df['age'].dtypes

dtype('float64')

In [44]:
ans = df.select_dtypes(exclude=object).columns

In [45]:
ans

Index(['Unnamed: 0', 'survived', 'pclass', 'age', 'sibsp', 'parch', 'fare',
       'adult_male', 'alone'],
      dtype='object')

### 범주형 column들만 나타내기

In [46]:
Ans = df.select_dtypes(include=object).columns

In [47]:
Ans

Index(['sex', 'embarked', 'class', 'who', 'deck', 'embark_town', 'alive'], dtype='object')

## 결측치 관리

### 결측치 확인

In [51]:
df.isnull().sum()

Unnamed: 0       0
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [134]:
df.isnull().sum().sort_values(ascending=False) / df.shape[0]

deck           0.772166
age            0.198653
embarked       0.002245
embark_town    0.002245
Unnamed: 0     0.000000
survived       0.000000
pclass         0.000000
sex            0.000000
sibsp          0.000000
parch          0.000000
fare           0.000000
class          0.000000
who            0.000000
adult_male     0.000000
alive          0.000000
alone          0.000000
dtype: float64

## 데이터 수치 확인

### 수치형 변수의 분포(사분위, 평균, 표준편차, 최대 , 최소) 확인

In [53]:
df.describe()

,Unnamed: 0,survived,pclass,age,sibsp,parch,fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### fare의 IQR 구하기

In [55]:
ans = df['fare'].quantile(0.75) - df['fare'].quantile(0.25)

In [56]:
ans

23.0896

## 연습 문제

### 남성 상위 3명을 나타내시오

In [62]:
man_data = df.loc[df['sex'] == 'male']

In [63]:
man_data.head(3)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

### index를 재정의하고 3명을 나타내시오

In [70]:
man_data.reset_index(drop=True, inplace=True)
man_data.head(3)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
2,5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

### fare에 $ 표시를 앞에다 해주기

In [73]:
man_data.loc[:, 'fare'] = '$' + man_data['fare'].astype(str)

In [74]:
man_data['fare'].head(3)

0      $$7.25
1      $$8.05
2    $$8.4583
Name: fare, dtype: object

In [75]:
man_data.loc[:,'fare'] = man_data['fare'].str[1:]

In [76]:
man_data['fare'].head(3)

0      $7.25
1      $8.05
2    $8.4583
Name: fare, dtype: object

### fare(비용)이 5 이하인 사람들 수를 나타내시오

In [78]:
len(df.loc[df['fare']<=5])

17

### fare가 10 이하고 여성인 사람들 수를 구하시오

In [82]:
len(df.loc[(df['fare']<=10) & (df['sex'] == 'female')])

64

### fare 기준 오름차순으로 정렬

In [83]:
ans = df.sort_values('fare').reset_index(drop=True)

In [84]:
ans

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,271,1,3,male,25.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,yes,True
1,597,0,3,male,49.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
2,302,0,3,male,19.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
3,633,0,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True
4,277,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
887,341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
888,737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
889,258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
890,679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False

## null 값 관리

In [121]:
df = pd.read_csv('data.csv', encoding='utf-8')

In [122]:
df.isnull().sum()

Unnamed: 0       0
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### null 값 int형인 경우 평균값 넣기

In [123]:
mean_age = df['age'].mean()
df['age'].fillna(mean_age, inplace=True)

In [126]:
df['embarked'].value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

### null 값 범주형인 경우 최빈값 넣기

In [130]:
embarked_mode = df['embarked'].mode().values[0]
df['embarked'].fillna(embarked_mode, inplace=True)

### null값 제거

In [131]:
df.dropna(inplace=True)

### embark_town 컬럼에서 Southampton이 포함된 경우

In [98]:
ans = df.loc[df.embark_town.str.contains('Southampton')]

In [99]:
ans.head(3)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False

In [100]:
ans.reset_index(drop=True)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
1,6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
2,10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
3,11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
4,21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
111,867,0,1,male,31.0,0,0,50.4958,S,First,man,True,A,Southampton,no,True
112,871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
113,872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
114,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [102]:
ans = ans[ans.columns[1:]]

In [104]:
ans.reset_index(drop=True, inplace = True)

In [105]:
ans

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
1,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
2,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
3,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
4,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
111,0,1,male,31.0,0,0,50.4958,S,First,man,True,A,Southampton,no,True
112,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
113,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
114,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [145]:
ans

Index(['Unnamed: 0', 'survived', 'pclass', 'age', 'sibsp', 'parch', 'fare',
       'adult_male', 'alone'],
      dtype='object')

In [160]:
train = df[ans]

In [161]:
train['pclass'].dtypes

dtype('int64')

In [162]:
train.loc[:,'pclass'] = train['pclass'].astype("category")

In [164]:
train.head(3)

   Unnamed: 0  survived pclass   age  sibsp  parch     fare  adult_male  alone
0           0         0      3  22.0      1      0   7.2500        True  False
1           1         1      1  38.0      1      0  71.2833       False  False
2           2         1      3  26.0      0      0   7.9250       False   True

### column drop하기

In [165]:
train.drop(columns=['sibsp'], inplace=True)

C:\Users\USER\AppData\Local\Temp\ipykernel_7672\2142301004.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train.drop(columns=['sibsp'], inplace=True)

## 수치형 스케일링

In [166]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  891 non-null    int64
 1   survived    891 non-null    int64
 2   pclass      891 non-null    category
 3   age         714 non-null    float64
 4   parch       891 non-null    int64
 5   fare        891 non-null    float64
 6   adult_male  891 non-null    bool
 7   alone       891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(3)
memory usage: 37.7 KB

In [168]:
scaling_cols = ['age', 'fare']

train_scaling = train[scaling_cols]

In [169]:
from sklearn.preprocessing import StandardScaler

std = StandardScaler()
std.fit(train_scaling)

StandardScaler()

In [170]:
train_scaled = std.transform(train_scaling)

In [171]:
train_scaled.shape

(891, 2)

In [193]:
train_scaled_df = pd.DataFrame(train_scaled, columns=scaling_cols)

## 수치형, 범주형 합치기

In [175]:
!pip install category_encoders

Collecting category_encoders
  Downloading category_encoders-2.6.3-py2.py3-none-any.whl.metadata (8.0 kB)
Requirement already satisfied: numpy>=1.14.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from category_encoders) (1.26.2)
Requirement already satisfied: scikit-learn>=0.20.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from category_encoders) (1.3.2)
Requirement already satisfied: scipy>=1.0.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from category_encoders) (1.11.4)
Collecting statsmodels>=0.9.0 (from category_encoders)
  Downloading statsmodels-0.14.2-cp311-cp311-win_amd64.whl.metadata (9.5 kB)
Requirement already satisfied: pandas>=1.0.5 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from category_encoders) (2.1.4)
Collecting patsy>=0.5.1 (from category_encoders)
  Downloading patsy-0.5.6-py2.py3-none-any.whl.metadata (3.5 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python311\site-packages (from pandas>=1.0.5->category_encoders) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas>=1.0.5->category_encoders) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas>=1.0.5->category_encoders) (2023.3)
Requirement already satisfied: six in c:\users\user\appdata\roaming\python\python311\site-packages (from patsy>=0.5.1->category_encoders) (1.16.0)
Requirement already satisfied: joblib>=1.1.1 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (1.3.2)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (3.2.0)
Requirement already satisfied: packaging>=21.3 in c:\users\user\appdata\roaming\python\python311\site-packages (from statsmodels>=0.9.0->category_encoders) (23.2)
Downloading category_encoders-2.6.3-py2.py3-none-any.whl (81 kB)
   ---------------------------------------- 0.0/81.9 kB ? eta -:--:--
   -------------------- ------------------- 41.0/81.9 kB 991.0 kB/s eta 0:00:01
   ----------------------------------- ---- 71.7/81.9 kB 991.0 kB/s eta 0:00:01
   ---------------------------------------- 81.9/81.9 kB 657.0 kB/s eta 0:00:00
Downloading patsy-0.5.6-py2.py3-none-any.whl (233 kB)
   ---------------------------------------- 0.0/233.9 kB ? eta -:--:--
   -------------- ------------------------- 81.9/233.9 kB 2.3 MB/s eta 0:00:01
   ---------------------------- ----------- 163.8/233.9 kB 2.5 MB/s eta 0:00:01
   -------------------------------------- - 225.3/233.9 kB 2.0 MB/s eta 0:00:01
   ---------------------------------------- 233.9/233.9 kB 1.6 MB/s eta 0:00:00
Downloading statsmodels-0.14.2-cp311-cp311-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 0.1/9.9 MB 3.6 MB/s eta 0:00:03
   - -------------------------------------- 0.3/9.9 MB 3.4 MB/s eta 0:00:03
   -- ------------------------------------- 0.6/9.9 MB 4.1 MB/s eta 0:00:03
   --- ------------------------------------ 1.0/9.9 MB 5.5 MB/s eta 0:00:02
   ----- ---------------------------------- 1.4/9.9 MB 6.5 MB/s eta 0:00:02
   -------- ------------------------------- 2.0/9.9 MB 7.6 MB/s eta 0:00:02
   ---------- ----------------------------- 2.7/9.9 MB 8.6 MB/s eta 0:00:01
   -------------- ------------------------- 3.6/9.9 MB 9.9 MB/s eta 0:00:01
   ------------------- -------------------- 4.8/9.9 MB 11.7 MB/s eta 0:00:01
   --------------------- ------------------ 5.4/9.9 MB 11.8 MB/s eta 0:00:01
   ------------------------- -------------- 6.4/9.9 MB 12.8 MB/s eta 0:00:01
   ------------------------------- -------- 7.7/9.9 MB 14.0 MB/s eta 0:00:01
   ------------------------------------ --- 8.9/9.9 MB 14.9 MB/s eta 0:00:01
   ---------------------------------------  9.8/9.9 MB 15.7 MB/s eta 0:00:01
   ---------------------------------------  9.9/9.9 MB 15.0 MB/s eta 0:00:01
   ---------------------------------------- 9.9/9.9 MB 14.0 MB/s eta 0:00:00
Installing collected packages: patsy, statsmodels, category_encoders
Successfully installed category_encoders-2.6.3 patsy-0.5.6 statsmodels-0.14.2

In [176]:
import category_encoders as ce

In [189]:
_train_encoded = pd.DataFrame()

for col in ['pclass']:
    _encoder = ce.OneHotEncoder(use_cat_names=True)
    _encoder.fit(train[col])
    _encoded = _encoder.transform(train[col])
    _train_encoded = pd.concat([_train_encoded, _encoded], axis=1)

In [194]:
train_encoded = pd.concat([train_scaled_df, _train_encoded], axis=1)
train_encoded.shape

(891, 5)

In [196]:
train_encoded.isnull().sum()

age           177
fare            0
pclass_3.0      0
pclass_1.0      0
pclass_2.0      0
dtype: int64

In [197]:
train_age_mean = train_encoded['age'].mean()
train_encoded['age'].fillna(train_age_mean, inplace=True)

In [199]:
df = train_encoded

## Model 활용하기

In [200]:
from sklearn.model_selection import KFold
from sklearn.metrics import accuracy_score
from sklearn.model_selection import StratifiedKFold
from sklearn import svm
from sklearn import datasets
from sklearn.metrics import roc_curve, auc
from sklearn.model_selection import RandomizedSearchCV

In [201]:
# 교차 검증
skf = StratifiedKFold(n_splits=5, shuffle=True, random_state=0)